{
  "cards": [
    {
      "title": "Abstração",
      "description": "Abstração é uma simplificação de ponto(s) específicos de algum sistema ou comportamento que estamos tentando entender. Na programação, usamos abstrações o tempo todo. Isso significa que não precisamos entender todos os detalhes técnicos profundos para escrever código - como o funcionamento interno de um computador. Em vez disso, podemos usar ideias mais simples para criar nossos programas.",
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "Variável tipada",
      "description": "Uma variável tipada é aquele que possui um tipo de dado associado a ela.",
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "Parâmetro",
      "description": "Uma parâmetro é uma informação passada para uma função ou método como parte de sua chamada.",
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "Parâmetro nomeado",
      "description": "É uma forma de passar valores para uma função ou método especificando o nome do parâmetro correspondente.",
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "Variável computada",
      "description": "É uma variável que não armazena um valor diretamente, ela calcula ou deriva seu valor de outras variáveis ou dados.",
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "Ternário",
      "description": "Expressão condicional.",
      "content": {
        "code": "Expressão ? Verdadeiro : Falso;"
      },
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "Stateless Widget",
      "description": "Um StatelessWidget, no Flutter, é um componente que não possui estado interno mutável, ideal para partes da interface do usuário que não mudam com o tempo e não dependem de estado.",
      "tags": [
        "Conceito",
        "Mobile"
      ]
    },
    {
      "title": "Stateful Widget",
      "description": "Um StatefulWidget, no Flutter, é um componente que possui estado interno mutável, permitindo que ele responda a mudanças de estado e atualize dinamicamente a interface do usuário.",
      "tags": [
        "Conceito",
        "Mobile"
      ]
    },
    {
      "title": "Função",
      "description": "Uma função é um bloco de código que realiza uma tarefa específica e pode ser chamado a partir de outras partes do programa. Ela ajuda a organizar e reutilizar o código, tornando o software mais modular e legível. As funções recebem entradas (chamadas de argumentos) e podem retornar um resultado (valor de retorno) ou simplesmente executar uma ação.",
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "Argumento",
      "description": "Um argumento é um valor ou uma informação que você fornece a uma função ou método durante sua chamada. Esses argumentos são usados pela função para realizar uma tarefa específica ou para tomar decisões com base nos valores fornecidos. Em resumo, os argumentos são dados de entrada que permitem que uma função realize seu trabalho e produza um resultado ou execute ações desejadas.",
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "Programação orientada a objetos",
      "description": "A programação orientada a objetos (POO) é um paradigma de programação que se baseia na ideia de modelar o software em torno de objetos, que são instâncias de classes. Cada objeto contém atributos (dados) e métodos (funções) que operam nesses dados. Isso permite organizar o código de forma mais modular, reutilizável e orientada para objetos do mundo real. POO promove conceitos como encapsulamento, herança e polimorfismo, facilitando a criação de sistemas mais flexíveis, compreensíveis e escaláveis.",
      "tags": [
        "Conceito",
        "Paradigma"
      ]
    },
    {
      "title": "Recursão",
      "description": "Recursão é um método/função que chama a si mesmo para resolver um problema.",
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "Classe",
      "description": "Uma classe, em desenvolvimento de software, é como molde e um \"modelo\" para criar objetos. Ela define os atributos (dados) e os métodos (funções) que os objetos criados a partir dela terão. Elas ajudam a organizar o código, permitindo a reutilização e a abstração de dados e funcionalidades em uma estrutura coerente.",
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "Objeto",
      "description": "Um objeto, em desenvolvimento de software, é como um personagem em um videogame. Ele tem características (dados) e pode fazer coisas (métodos). Por exemplo, um objeto \"carro\" pode ter cor, velocidade e marca (características) e pode acelerar, frear e virar (ações/métodos). Os objetos são instâncias de classes e permitem organizar o código de forma a representar entidades do mundo real, tornando-o mais compreensível e reutilizável.",
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "Encapsulamento",
      "description": "O encapsulamento funciona como uma \"caixa mágica\" que esconde os detalhes internos de um objeto. Isso significa que os dados e o funcionamento interno de um objeto são mantidos privados e não podem ser acessados diretamente de fora. Em vez disso, o objeto fornece interfaces controladas (métodos públicos) para interagir com ele. Isso ajuda a proteger os dados do objeto e controlar como ele é usado, promovendo a segurança e a organização do código.",
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "Herança",
      "description": "A herança funciona como uma \"árvore genealógica\". Permite que uma classe ou objeto herde características e comportamentos de outra classe pai. Isso significa que a classe filha herda os atributos e métodos da classe pai, economizando tempo e promovendo a reutilização de código. A herança é uma forma de organizar e estruturar o código, criando hierarquias de classes que representam relacionamentos entre objetos do mundo real.",
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "Polimorfismo",
      "description": "O polimorfismo permite que objetos de diferentes tipos se comportem de maneira semelhante através de uma interface compartilhada.",
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "Code Smells",
      "description": "Code smells são indicadores de possíveis problemas no código que, embora não causem erros imediatos ou impeçam o funcionamento do software, podem sugerir áreas de risco que podem levar a dificuldades futuras na manutenção e evolução do código. Eles geralmente apontam para problemas de design, duplicação, complexidade ou falta de clareza que podem tornar o código mais difícil de entender, modificar ou estender.",
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "Desenvolvimento Front-end",
      "description": "Desenvolvimento front-end é o desenvolvimento da interface gráfica, para que as pessoas usuárias possam visualizar e interagir com o que foi desenvolvido.",
      "tags": [
        "Front-end"
      ]
    },
    {
      "title": "HTML",
      "description": "HTML é uma linguagem de marcação utilizada na construção de páginas na web. Documentos HTML podem ser interpretados por navegadores.",
      "tags": [
        "Front-end"
      ]
    },
    {
      "title": "CSS",
      "description": "Cascading Style Sheets é um mecanismo para adicionar estilos a uma página web como cores, tamanhos, fontes e etc. é possivel ligar o arquivo HTML ao CSS adicionando um link para um arquivo CSS que contém os estilos.",
      "tags": [
        "Front-end"
      ]
    },
    {
      "title": "JavaScript",
      "description": "JavaScript é uma linguagem de programação interpretada estruturada, de script em alto nível com tipagem dinâmica fraca e multiparadigma. Juntamente com HTML e CSS, o JavaScript é uma das três principais tecnologias para criação de sites.",
      "tags": [
        "Front-end",
        "Back-end"
      ]
    },
    {
      "title": "jQuery",
      "description": "Biblioteca de funções em JavaScript que interagem com o HTML de uma maneira muito mais rápida e simples do que apenas pelo JavaScript.",
      "tags": [
        "Front-end",
        "Biblioteca"
      ]
    },
    
    {
      "title": "UI Design",
      "description": "É o desenho e execução de uma interface para a pessoa usuária. Por exemplo, garantir que um botão vai ser visto e apertado.",
      "tags": [
        "Conceito",
        "Front-end",
        "Design"
      ]
    },
    {
      "title": "UX Design",
      "description": "É o desenho e execução de uma experiência para a pessoa usuária. Por exemplo, desenhar as ações que farão com a pessoa se sinta bem ao entrar numa página, ou engajado, etc.",
      "tags": [
        "Conceito",
        "Front-end",
        "Design"
      ]
    },
    {
      "title": "Frameworks",
      "description": "São como coleções de ferramentas, componentes e soluções que você pode encontrar em um mesmo pacote (o framework) que facilitam a criação de aplicações complexas.",
      "tags": [
        "Framework",
        "Conceito"
      ]
    },
    {
      "title": "Spread Operator",
      "description": "O operador spread é um operador que está presente em várias linguagens de programação, que permite copiar e combinar elementos de uma estrutura de dados em outra, facilitando a manipulação eficiente de informações.",
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "Algoritmo",
      "description": "Um algoritmo é como uma receita de bolo para o computador. É um conjunto de passos organizados que ajudam a resolver um problema, como fazer contas ou analisar informações.",
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "Git",
      "description": "Git é um sistema de controle de versão distribuído amplamente utilizado para rastrear as alterações em arquivos e coordenar o trabalho em projetos de desenvolvimento de software.",
      "tags": [
        "Conceito",
        "Versionamento",
        "Ferramenta"
      ]
    },
    {
      "title": "GitHub",
      "description": "O GitHub é uma plataforma de hospedagem de código-fonte baseada na web que oferece uma variedade de serviços relacionados ao controle de versão e colaboração no desenvolvimento de software (é usado em conjunto com o Git). Ele é amplamente utilizado por pessoas desenvolvedoras de todo o mundo para armazenar, colaborar, gerenciar e controlar o código-fonte de projetos de software.",
      "tags": [
        "Conceito",
        "Versionamento",
        "Ferramenta"
      ]
    },
    {
      "title": "Optional Chaining",
      "description": "O Optional Chaining é um recurso no Javascript para lidar com situações onde você precisa acessar propriedades de objetos aninhados mas não tem certeza se essas propriedades existem realmente, Isso ajuda a evitar erros de 'TypeError' quando tenta acessar algo que não foi definido.",
      "content": {
        "code": "const pessoa = nome?.cidade?.endereco; "
      },
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "Linguagem Baixo Nível",
      "description": "Linguagem de programação que possui pouca ou nenhuma abstração do computador. É uma linguagem de programação que está mais próxima da linguagem de máquina.",
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "Endereço de Memória",
      "description": "É um número que identifica unicamente uma posição de memória no computador. Tudo que é declarado em uma linguagem de programação é armazenado na memória do computador, e para acessar esses dados é necessário saber o endereço de memória onde eles estão armazenados.",
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "Ponteiros",
      "description": "Um ponteiro é um tipo de dado de uma linguagem de programação que armazena ou se refere ao endereço de memória de outro valor localizado na memória do computador. Um ponteiro refere-se a um local na memória e obtém o valor desse local. Como tal, um ponteiro é um tipo de dado que 'aponta' para um valor.",
      "content": {
        "code": "int *ponteiro; // ponteiro para um inteiro em linguagem C/C++"
      },
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "C",
      "description": "C é uma linguagem de programação compilada de propósito geral, estruturada, imperativa, procedural, padronizada pela ISO, criada em 1972, por Dennis Ritchie, no AT&T Bell Labs, para desenvolver o sistema operacional Unix (que foi originalmente escrito em Assembly).",
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "C++",
      "description": "C++ é uma linguagem de programação compilada multi-paradigma (seu suporte inclui linguagem imperativa, orientada a objetos e genérica) e de uso geral. Desde os anos 1990 é uma das linguagens comerciais mais populares, sendo bastante usada também na academia por seu grande desempenho e base de utilizadores.",
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "Bug",
      "description": "O termo Bug é comumente usado para informar que há algum problema no programa ou no ambiente. Pode ser um comportamento incorreto ou inesperado, geralmente causados por lógica incorreta no código, causando falhas durante a execução de um software.",
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "Compilador",
      "description": "Um compilador é como um tradutor de idiomas para computadores. Ele pega o código escrito por pessoas programadoras em uma forma que é fácil para elas entenderem (chamado de código de alto nível) e o transforma em um tipo de linguagem que o computador consegue entender e seguir (isso é chamado de código de baixo nível). Ele faz isso passo a passo, como se estivesse quebrando o processo em partes menores.",
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "React Native",
      "description": "É um framework do Javascript baseado no React para desenvolvimento de aplicativos móveis multiplataforma.",
      "tags": [
        "Conceito",
        "Front-end"
      ]
    },
    {
      "title": "Mobile First",
      "description": "Esse conceito determina que ao criarmos um site, devemos primeiro atender as necessidades dos dispositivos móveis.",
      "tags": [
        "Conceito",
        "Front-end"
      ]
    },
    {
      "title": "SQL",
      "description": "A Linguagem de Consulta Estruturada (SQL) é uma linguagem de programação usada para gerenciar dados em bancos de dados relacionais. É como uma linguagem que nos permite falar com os bancos de dados para fazer coisas como buscar, adicionar, atualizar e deletar informações.",
      "tags": [
        "Conceito",
        "Back-end"
      ]
    },
    {
      "title": "Node.js",
      "description": "Node.js é um ambiente que permite executar JavaScript no servidor. Isso significa que podemos usar JavaScript para criar e rodar aplicações do lado do servidor.",
      "tags": [
        "Back-end"
      ]
    },
    {
      "title": "Cache",
      "description": "O cache é uma técnica de armazenamento temporário de dados frequentemente usados para melhorar o desempenho e a velocidade de acesso a esses dados em sistemas computacionais.",
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "React",
      "description": "React é uma biblioteca JavaScript de código aberto utilizada para criar interfaces de usuário interativas e dinâmicas em aplicações web e em outros ambientes, como mobile, TV, realidade virtual, entre outros. Ele se destaca por seu modelo de programação baseado em componentes e pela eficiência na atualização da interface do usuário, tornando-o uma escolha popular no desenvolvimento front-end.",
      "tags": [
        "Conceito",
        "Front-end"
      ]
    },
    {
      "title": "Componente",
      "description": "Um componente é uma unidade fundamental e reutilizável de construção de interfaces de usuário. Ele encapsula a lógica e a apresentação relacionadas a uma parte específica da interface. Componentes podem ser comparados a blocos de construção que, quando combinados, formam interfaces complexas. Eles promovem a organização e a manutenibilidade do código, uma vez que podem ser desenvolvidos e testados de forma independente. Os componentes podem aceitar propriedades (props) como entrada e renderizar informações com base nesses dados, permitindo uma personalização flexível.",
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "Propriedade",
      "description": "Propriedades, frequentemente abreviadas como 'props', são mecanismos que permitem passar dados de um componente pai para um componente filho. Elas são usadas para personalizar o comportamento e a aparência de um componente. Por exemplo, ao criar um botão, você pode passar propriedades como a cor de fundo, o texto exibido e o tamanho do texto como props. As props são cruciais para tornar os componentes reutilizáveis e configuráveis, permitindo que eles se adaptem a diferentes contextos de uso.",
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "React Native",
      "description": "É um framework do Javascript baseado no React para desenvolvimento de aplicativos móveis multiplataforma.",
      "tags": [
        "Mobile"
      ]
    },
    {
      "title": "Expo CLI",
      "description": "O Expo CLI é uma ferramenta que facilita o desenvolvimento de aplicativos móveis para iOS e Android. É utilizado para criar rapidamente um projeto com o React Native",
      "tags": [
        "Mobile"
      ]
    },
    {
      "title": "Stack Navigation",
      "description": "No contexto do React Native, é uma técnica de navegação entre as telas do aplicativo, quando o aplicativo têm os botões de voltar e avançar, por exemplo.",
      "tags": [
        "Mobile"
      ]
    },
    {
      "title": "Ambiente",
      "description": "Costumamos chamar de ambiente o lugar ou os servidores onde o que foi desenvolvido fica disponível para testes, validações, pessoas usuárias finais utilizarem ou demais necessidades. Esse servidor seria como um computador. Pode ser um computador físico ou disponível na nuvem. Existem os ambientes local e dev (onde o desenvolvimento está acontecendo), homolog (ou ainda hom, homol, homologação - onde os testes costumam ser feitos)e produção (onde está disponível o sistema final, desenvolvido e testado, para pessoas usuárias).",
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "API",
      "description": "API é uma sigla que, em inglês, significa: Application Programming Interface. Traduzindo para português, seria uma interface programada para aplicações. É uma estrutura de código que atende a alguns requisitos, seguindo normas e padrões de desenvolvimento, facilitando a organização de sistemas grandes. Disponibiliza funcionalidades e informações para aplicativos e sites. Por exemplo: API dos Correios que disponibiliza consulta de CEP e endereço de maneira simplificada.",
      "tags": [
        "Conceito",
        "Back-end"
      ]
    },
    {
      "title": "Code Review",
      "description": "Code review significa revisão de código. Trata-se de uma boa prática muito indicada para o processo de desenvolvimento de sistemas, pelo qual as pessoas desenvolvedoras do time ajudam umas as outras. Normalmente, após o término da etapa de desenvolvimento de cada tarefa, antes do código ser disponibilizado para testes, o time avalia o que foi feito e dá sugestões do que pode ser melhorado, quando necessário. Isso traz diversos benefícios. Alguns deles são: melhorar a parte técnica do time, melhoria do desenvolvimento, qualidade do código, integração do time, todas as pessoas conhecem o que está sendo desenvolvido, entre outros.",
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "Commit",
      "description": "Quando trabalhamos com versionamento de código (o que é altamente recomendado), a palavra commit é bastante comum entre as pessoas desenvolvedoras. Mas essa palavra também é utilizada por quem atua em banco de dados. Quando se tem um conjunto de alterações feitas em um código, a pessoa faz o comando commit que salva o que foi feito dentro do projeto. Existe também o commit semântico, que significa que esse conjunto de alterações deve ter um significado para o projeto. O commit também serve para finalizar uma transação dentro de um sistema de gerenciamento de banco de dados, tornando visíveis as alterações. Essa transação normalmente vai começar com o comando begin e finalizar com o comando commit.",
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "Deploy",
      "description": "O deploy é um processo complexo. Mas significa que foi instalado um pacote do que foi desenvolvido nos ambientes. É gerada uma versão para que seja disponibilizada. Esse processo também pode ser chamado de implantação dependendo do contexto. Para que essa implantação aconteça, pode ser um processo automatizado com ferramentas, ou feito manualmente, dependendo da estrutura. Acabamos aportuguesando a palavra deploy, tornando-a uma ação. Exemplo: estou deployando a nova versão do nosso sistema.",
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "Json",
      "description": "Em inglês significa JavaScript Object Notation. Json é um tipo de arquivo e tem uma estrutura com nome do dado e valor do dado. Dependendo do tipo de API que construímos, utilizamos o formato Json para transferir os dados entre sistemas. Por exemplo: API que consulta clientes em seu negócio. A resposta da API pode vir em formato json.",
      "content": {
        "code": "{name: 'Morganna', cpf: '000.000.000-00', email: 'email@email.com'}"
      },
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "Pair Programming",
      "description": "Pair programming significa programação em par. É uma técnica em que duas pessoas (ou mais) trabalham juntas em uma tarefa. Isso ajuda na troca de conhecimento e experiência entre pessoas desenvolvedoras. Duas cabeças pensam melhor que uma, certo? Algumas formas de aplicar pair programming: uma pessoa está mexendo no código enquanto recebe orientações da outra e elas vão trocando de posição; uma pessoa desenvolve os testes e a outra desenvolve a funcionalidade. Não encare pair programming como desperdício de tempo. Uma boa integração e senso de apoio no time pode fazer toda a diferença na qualidade do que for entregue.",
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "Pull Request",
      "description": "Trata-se de uma requisição de alteração dentro de um projeto. Essa requisição pode ser feita para corrigir um problema, adicionar uma nova funcionalidade, sugerir alterações, entre outros motivos. Essa requisição de alteração é feita para que haja uma avaliação do que está sendo alterado dentro do projeto, entendendo de faz sentido para o contexto daquele momento. E essa requisição pode ficar pendente até que pessoas responsáveis ou que tenham a permissão, aprovem. Outras regras podem ser adicionadas nessas requisições, como build da aplicação, rodar testes com sucesso e o que mais fizer sentido para o projeto em questão.",
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "Banco de Dados",
      "description": "Um banco de dados é uma coleção organizada de informações ou dados, armazenados eletronicamente de forma estruturada, para permitir o armazenamento, recuperação e manipulação eficiente dessas informações. É utilizado para armazenar dados de forma persistente, tornando-os acessíveis para aplicativos e sistemas de software, permitindo a consulta, atualização e análise dos dados de maneira eficaz.",
      "tags": ["Conceito"]
    },
    {
      "title": "Banco Relacional",
      "description": "Um banco de dados relacional é um sistema que organiza dados em tabelas com linhas e colunas, onde as informações são armazenadas de forma estruturada, com relações definidas entre as tabelas. É baseado no modelo de dados relacional e usa a linguagem SQL para consultas.",
      "tags": ["Conceito"]
    },
    {
      "title": "Integração Contínua",
      "description": "Integração contínua é a prática de testar frequentemente as partes do código que vão sendo adicionadas em um projeto, isso impede que bugs e erros possam ser adicionados, fazendo, de forma eficiente, testes específicos que verificam a integração de cada parte.",
      "tags": ["Conceito"]
    },
    {
      "title": "NoSQL",
      "description": "NoSQL (Not Only SQL) é uma abordagem de banco de dados que permite armazenar, recuperar e gerenciar dados de forma flexível e escalável, sem a estrutura rígida de tabelas relacionais, sendo adequado para dados não estruturados ou semiestruturados.",
      "tags": ["Conceito"]
    },
    {
      "title": "Lambda",
      "description": "Lambda é uma função anônima em programação que pode ser definida e usada sem um nome específico, frequentemente usada para expressões simples em uma única linha.",
      "content": {
        
        "code": "soma = lambda x, y: x + y"
      },
      
      "tags": ["Conceito"]
    },
    {
      "title": "Ruby",
      "description": "Ruby é uma linguagem de programação interpretada multiparadigma, de tipagem dinâmica e forte, com gerenciamento de memória automático. Ruby suporta programação funcional, orientada a objetos, imperativa e reflexiva. É como uma caixa de ferramentas digital que pode criar, organizar e fazer interagir diferentes partes em um programa de computador, sendo capaz de lidar com diversos estilos de programação.",
      "tags": [
        "Conceito",
        "Back-end"
      ]
    },
    {
      "title": "ORM",
      "description": "O mapeamento objeto-relacional (ORM) é como traduzimos tabelas de um banco de dados para o código, transformando-as em classes e objetos.",
      "tags": [
        "Conceito",
        "Back-end"
      ]
    },  
	{
      "title": "UML",
      "description": " É uma linguagem visual que os desenvolvedores de software usam para descrever e projetar sistemas de software. Ela oferece diferentes tipos de diagramas, como diagramas de classes, sequência e atividades, para representar diferentes aspectos de um sistema. Esses diagramas ajudam as equipes a entenderem e comunicarem melhor as ideias e os designs do software.",
      "tags": [
        "Back-end"
      ]
    },
  {
    "title": "Scrum",
    "description": " É um método para gerenciar projetos onde o trabalho é dividido em pequenos pedaços chamados de 'sprints', que geralmente duram algumas semanas. A equipe trabalha em estreita colaboração, se encontrando regularmente para planejar, revisar e ajustar o trabalho. O objetivo é entregar valor de forma rápida e iterativa, respondendo às mudanças e feedbacks conforme o projeto avança.",
    "tags": [
      "Back-end"
    ]
    },
    {
      "title": "Coalescência nula",
      "description": "Operador lógico que permite tratar valores nulos, retornando o valor à direita caso o valor à esquerda seja nulo.",
      "content": {
        "code": "let valor = valorDesejado ?? 42"
      },
      "tags": [
        "Conceito"
      ]
    },
    {
      "title": "Swift",
      "description": "Swift é uma linguagem de programação criada pela Apple. Com ela, você pode desenvolver aplicativos para dispositivos e sistemas operacionais da Apple, como iPhones (iOS), Macs (macOS), Apple Watches (watchOS) e Apple TVs (tvOS).",
      "tags": [
        "Mobile"
      ]
    },
    {
      "title": "UIKit",
      "description": "UIKit é um conjunto de ferramentas fornecido pela Apple para criar as partes visuais dos aplicativos iOS. Ele fornece um conjunto de classes e componentes para construir e gerenciar a interface, incluindo elementos como botões, tabelas, views e gestos.",
      "tags": [
        "Mobile"
      ]
    },
    {
      "title": "SwiftUI",
      "description": "SwiftUI é uma ferramenta da Apple para criar a parte visual dos aplicativos usando a linguagem Swift. Ao contrário do UIKit, que é mais tradicional, o SwiftUI permite que você descreva a interface do usuário de uma maneira mais simples e direta, facilitando tanto a criação quanto a manutenção do seu código.",
      "tags": [
        "Mobile"
      ]
    },
    {
      "title": "SOLID",
      "description": "Os princípios SOLID são cinco diretrizes para design de software orientado a objetos, promovendo sistemas mais flexíveis, robustos e de fácil manutenção. Sendo, Single Responsibility Principle (Uma classe deve ter apenas uma responsabilidade), Open/Closed Principle (Classes devem estar abertas para extensão, mas fechadas para modificação), Liskov Substitution Principle (Subclasses devem ser substituíveis por suas superclasses sem alterar a correção do programa), Interface Segregation Principle (Classes não devem ser forçadas a implementar interfaces que não utilizam) e Dependency Inversion Principle (Módulos de alto nível não devem depender de módulos de baixo nível; ambos devem depender de abstrações).",
      "tags": [
        "Conceito"
      ]
    }
  ]
}